from main import *
from pysat.solvers import Glucose4


def clique_colouring(k: int) -> int:
    # Напишите функцию, которая по данному k определяет максимальный размер клики,
    # рёбра которой можно покрасить в k цветов таким образом, что ни один треугольник из рёбер не
    # покрашен в один цвет. Например, для k = 1 ответ 2, для k = 2 ответ 5.
    assert k >= 1, "Invalid input"
    size = 2
    while True:
        encoder = EncoderVerbose2(Clique(size + 1), total_colours=k)
        solver = Glucose4()
        encoded = encoder.encode()
        solver.append_formula(encoded)
        if not solver.solve():
            return size
        size += 1


def sudoku(board: list[list[int]]) -> list[list[int]]:
    """
    board -- доска судоку - матрица 9 на 9 чисел. Каждое число от 0 до 9.
    Числа от 1 до 9 - обычные числа из судоку, число 0 обозначает пустую ячейку.
    :returns матрица 9 на 9 чисел, решение входной доски (все 0 заменены на числа 1 до 9 в соответствии с правилами судоку)
    :returns пустой список, если решения нет
    """
    solver = Glucose4()
    encoder = SudokuEncoder(board)
    solver.append_formula(encoder.encode())
    if not solver.solve():
        return []
    return encoder.decode(solver.get_model())


def check_sudoku(board: list[list[int]], solution: list[list[int]]) -> bool:
    if not solution:
        return True
    n = 9

    def instantiates_cell(p, i):
        return p == 0 and (1 <= i <= n) or p == i

    def instantiates_line(line1, line2):
        return len(line1) == len(line2) and all(
            instantiates_cell(x, y) for x, y in zip(line1, line2)
        )

    def instantiates(board, solution):
        return len(board) == len(solution) and all(
            instantiates_line(line1, line2) for line1, line2 in zip(board, solution)
        )

    if not instantiates(board, solution):
        return False
    cell = 3
    complete = set(range(1, n + 1))
    for line in solution:
        if set(line) != complete:
            return False
    for i in range(n):
        column = [line[i] for line in solution]
        if set(column) != complete:
            return False
    for start_i in range(3):
        for start_j in range(3):
            cell_values = set()
            for i in range(start_i * cell, (start_i + 1) * cell):
                for j in range(start_j * cell, (start_j + 1) * cell):
                    cell_values.add(solution[i][j])
            if cell_values != complete:
                return False
    return True


def classic_sudoku_to_general(classic: str) -> list[list[int]]:
    line = [0 if c == "." else int(c) for c in classic]
    classic_size = 9
    board = [
        line[classic_size * i : classic_size * (i + 1)] for i in range(classic_size)
    ]
    return board


def test_sudoku():
    solvable = [
        "..53.....8......2..7..1.5..4....53...1..7...6..32...8..6.5....9..4....3......97..",
        "8..........36......7..9.2...5...7.......457.....1...3...1....68..85...1..9....4..",
        "4.....8.5.3..........7......2.....6.....8.4......1.......6.3.7.5..2.....1.4......",
        "52...6.........7.13...........4..8..6......5...........418.........3..2...87.....",
        "6.....8.3.4.7.................5.4.7.3..2.....1.6.......2.....5.....8.6......1....",
        "..3.2.6..9..3.5..1..18.64....81.29..7.......8..67.82....26.95..8..2.3..9..5.1.3..",
        "2...8.3...6..7..84.3.5..2.9...1.54.8.........4.27.6...3.1..7.4.72..4..6...4.1...3",
        "......9.7...42.18....7.5.261..9.4....5.....4....5.7..992.1.8....34.59...5.7......",
        "1.......2.9.4...5...6...7...5.9.3.......7.......85..4.7.....6...3...9.8...2.....1",
        "48.3............71.2.......7.5....6....2..8.............1.76...3.....4......5....",
        "....14....3....2...7..........9...3.6.1.............8.2.....1.4....5.6.....7.8...",
        "......52..8.4......3...9...5.1...6..2..7........3.....6...1..........7.4.......3.",
        "6.2.5.........3.4..........43...8....1....2........7..5..27...........81...6.....",
        ".524.........7.1..............8.2...3.....6...9.5.....1.6.3...........897........",
        "1.....3.8.7.4..............2.3.1...........958.........5.6...7.....8.2...4.......",
        ".....6....59.....82....8....45........3........6..3.54...325..6..................",
        "85...24..72......9..4.........1.7..23.5...9...4...........8..7..17..........36.4.",
        "12.3....435....1....4........54..2..6...7.........8.9...31..5.......9.7.....6...8",
        "1....7.9..3..2...8..96..5....53..9...1..8...26....4...3......1..4......7..7...3..",
        "..............3.85..1.2.......5.7.....4...1...9.......5......73..2.1........4...9",
        "3.6.7...........518.........1.4.5...7.....6.....2......2.....4.....8.3.....5.....",
        "1.....7.9.4...72..8.........7..1..6.3.......5.6..4..2.........8..53...7.7.2....46",
        "4.....3.....8.2......7........1...8734.......6........5...6........1.4...82......",
        ".......71.2.8........4.3...7...6..5....2..3..9........6...7.....8....4......5....",
        ".3..5..4...8.1.5..46.....12.7.5.2.8....6.3....4.1.9.3.25.....98..1.2.6...8..6..2.",
        ".2.81.74.7....31...9...28.5..9.4..874..2.8..316..3.2..3.27...6...56....8.76.51.9.",
        "1..92....524.1...........7..5...81.2.........4.27...9..6...........3.945....71..6",
        ".43.8.25.6.............1.949....4.7....6.8....1.2....382.5.............5.34.9.71.",
        "48...69.2..2..8..19..37..6.84..1.2....37.41....1.6..49.2..85..77..9..6..6.92...18",
        "...9....2.5.1234...3....16.9.8.......7.....9.......2.5.91....5...7439.2.4....7...",
        "..19....39..7..16..3...5..7.5......9..43.26..2......7.6..1...3..42..7..65....68..",
        "812753649943682175675491283154237896369845721287169534521974368438526917796318452",
        "812753649943682175675491283154237896369.45721287169534521974368438526917796318452",
        "812753649943682175675491283154237896369845721287169534521974368.........796318452",
        "1.........2.........3.........4.........5.........6.........7.........8.........9",
        "987654321" + "." * 72,
        "." * 81,
    ]
    unsolvable = [
        "11" + "." * 79,
        "1" + "." * 8 + "1" + "." * 71,
        "1" + "." * 9 + "1" + "." * 70,
        "12345678." + "." * 36 + "........9" + "." * 27,
        "5" + "." * 19 + "5" + "." * 60,
        "." * 72 + "7" + "." * 7 + "7",
        "182753649943682175675491283154237896369845721287169534521974368438526917796318452",
        "." * 8 + "3" + "." * 63 + "." * 8 + "3",
        "." * 30 + "4" + "." * 19 + "4" + "." * 30,
        "912753649943682175675491283154237896369845721287169534521974368438526917796318452",
        "..53.....8......2..7..1.5..4....53...1..7...6..32...8..6.5....9..4....3......975.",
    ]
    for classic in solvable:
        board = classic_sudoku_to_general(classic)
        solution = sudoku(board)
        assert solution and check_sudoku(board, solution)
    for classic in unsolvable:
        assert sudoku(classic_sudoku_to_general(classic)) == []


if __name__ == "__main__":
    assert clique_colouring(1) == 2
    assert clique_colouring(2) == 5

    test_sudoku()
